{
    "user": {
        "name": "Kevin Palani",
        "phone": "408-893-0826",
        "email": "kevinrp2@illinois.edu",
        "giturl": "https://github.com/KevinPal",
        "gitnice": "github.com/KevinPal",
        "address": "San Jose, California"
    },
    "academics": {
        "relevant_coursework": {
            "cs": ["Quantum Computing", "Algorithms", "FPGAs", "Robotics", "Data Structures", "Operating Systems"]
        },
        "school": "University of Illinois Urbana Champaign (UIUC)",
        "degree": "Bachelor of Science in Computer Engineering",
        "year": "Junior",
        "gradyear": "May 2022"
    },
    "career": {
        "experience": [
            {
                "role": "Software Engineering Intern",
                "company": "Quantum Corp",
                "date": "May 2019 - Present",
                "description": "Worked on a set of services which allows support personnel to monitor and repair on-premise appliances remotely. Used transient Docker containers to facilitate secure connections between authorized support personnel and product, along with additions to the web UI, and changes to the Postgres database and python/php backend to manage the connection based on customer preferences."
            },
            {
                "role": "Course Assistant and Researcher",
                "company": "UIUC Staff",
                "date": "January 2020 - Present",
                "description": "Researched in the Augmented Listening Lab to develop a real-time beamforming platform for large microphone arrays on an FPGA. Also worked as a course assistant for a Digital Systems/FPGA class, where I assisted in lab sections and led office hours to help and teach students about digital design."

            },
            {
                "role": "Software Engineering Intern",
                "company": "Nebbiolo Technologies",
                "date": "June - August 2018",
                "description": "Extended the data analysis pipeline to allow for distributed analysis and computation, and upgraded the data visualizer to remotely view graphs. Also significantly reduced Docker container sizes by optimizing Dockerfiles."

            }
        ],
        "skillsets": [
            {
                "name": "Programming Languages",
                "skills": ["Python", "C/C\\verb!++!", "Java", "SystemVerilog", "php", "Javascript", "NodeJS" ]
            },
            {
                "name": "Tools/Frameworks",
                "skills": ["AWS", "Linux", "Docker", "SQL", "git", "vim", "Quartus", "\\LaTeX", "Laravel", "Microsoft Office"]
            }
        ],
        "projects": [
            {
                "title": "Operating System from scratch",
                "date": "March - May 2020",
                "description": "Led a team of 4 students to develop an operating system from the ground up. Included dynamic memory support, dynamic processes, a GUI with mouse support and multiple terminals, memory and cpu virtualisation, interrupt support, custom drivers, user programs, and multithreading."
            },
            {
                "title": "3D Renderer in SystemVerilog on an FPGA",
                "date": "November - December 2019",
                "description": "Designed and developed a GPU on a CycloneIV FPGA capable of arbitrary texured 3D rendering, and used it within an Avalon SOC along with the Intel NIOS II processor to build a game in which the user could move through and modify a 3D world."
            },
            {
                "title": "Ocarina of Time Randomizer",
                "date": "August 2018 - April 2020",
                "description": "Contributed to an Open Source project 'Ocarina of Time Randomizer'. Reverse engineered the functionality of a base ROM, then used Python, C, and MIPS to make and inject changes based on player suggestions."
            },
            {
                "title": "FRC FIRST Robotics",
                "date": "August 2014 - May 2018",
                "description": "Led a team of students as Programming Lead to program an FRC robot, which qualified for the world championships. Worked on PID, computer vision, distributed computing, and motion profiling."
            }
        ]
    }
}
